# ShowGraphicalOpenEndsAreaBasedLoadBoundaryDisconnects Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..ShowGraphicalOpenEndsAreaBasedLoadBoundaryDisconnects Property
Application Class See Also
---
Whether or not to show the graphical open ends for Area Based Load Boundary disconnects.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public bool ShowGraphicalOpenEndsAreaBasedLoadBoundaryDisconnects { get; set; }
```

Visual Basic
---
```text
Public Property ShowGraphicalOpenEndsAreaBasedLoadBoundaryDisconnects As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowGraphicalOpenEndsAreaBasedLoadBoundaryDisconnects {
	bool get ();
	void set (bool value);
}
```

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace